{"inkVersion":20,"root":[["^Not bad for someone who hasn't learned any form of magic spells to boost oneself!",{"#":"speaker:Turtino"},{"#":"portrait:dinotrainer_neutral"},{"#":"layout:right"},"\n","^How about we come back here before we graduate from the academy once you've learned how to use and wield magic?","\n","^That was a fun training session!","\n","^Been a while since I had a challenge.","\n","^Here's something to help you on your first day.","\n","^Though, it's not like you can use it yet.","\n","^I'm going back to my personal training sessions now.","\n","^Bye!","\n","ev","str","^...","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Read creator's message","/str","/ev",{"*":"0.c-1","flg":20},{"c-0":["\n","done",{"->":"0.g-0"},{"#f":5}],"c-1":["\n","^<b><i>A word from the creator of the game:</i></b>",{"#":"speaker:???"},{"#":"portrait:default"},{"#":"layout:right"},"\n","^<i>You have completed the game!</i>","\n","^<i>I thought I made the game too hard, so I had to modify the difficulty many times!</i>","\n","^<i>This is more of a <b><color=#cc0000>prototype</color></b> of a game if I were to be honest.</i>","\n","^<i>If I had more time to work on the game I would change its entire foundation,</i>","\n","^<i>as in the process of adding things on top of the current foundation I found a lot of limits to it,</i>","\n","^<i>such as not being able to add abilities to the player that involved collisions, especially with enemies.</i>","\n","^<i>(Projectiles, shields, movement abilities)</i>","\n","^<i>Anyways, even though it's my first time I had a lot of fun creating the game.</i>","\n","^<i>I've learned quite a bit about basic design like detecting collisions with objects and enemies,</i>","\n","^<i>creating menus, and dialogue for npcs and players,</i>","\n","^<i>even though they are rather simple.</i>","\n","^<i>Anyways,</i>","\n","^<i>thank you for playing my prototype of a game!</i>","\n","^<i>Feel free to exit the game now.</i>","\n","end",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}