{"inkVersion":20,"root":[["^... ",{"#":"speaker:???"},{"#":"portrait:dinotrainer_neutral"},{"#":"layout:right"},"\n","ev","str","^Hello?","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Continue to dungeon","/str","/ev",{"*":"0.c-1","flg":20},{"c-0":["\n","^...","\n","^<i>The dino stares at you intensely</i>","\n",["ev","str","^...","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Stare back intensely","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^Oh, you noticed me!","\n",{"->":"dino_intro"},{"->":"0.g-0"},{"#f":5}],"c-1":["\n","^Finally, someone knows how to respond!","\n",{"->":"dino_intro"},{"->":"0.g-0"},{"#f":5}]}],{"#f":5}],"c-1":["\n","^<i>You ignore the dino and proceed into the dungeon.</i>","\n","done",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"dino_intro":[["^Those applicants that just entered the dungeon were really boring.","\n","^They straight up ignored me!","\n","ev","str","^Who're you","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^Oh, you want to know who I am?","\n","^Hehe.","\n","^That's something I only share to people who pass this combat exam.","\n","^Anyways,","\n","^Want to learn about the dungeon's secrets?","\n",["ev","str","^What secrets?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^I already know its secrets","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"game_mechanics_info"},{"#f":5}],"c-1":["\n","^Ah, you must be some sort of genius then.","\n","^No one is supposed to know the dungeon's secrets.","\n","^That's amazing!","\n","^You MUST come visit the <b><color=#c90076>training room</color></b> if you pass the exam!","\n","^I will prepare a reward that'll be worth your visit!","\n","^<i>You prepare to enter the dungeon, and gestured goodbye to the dino</i>","\n","done",{"#f":5}]}],{"#f":5}]}],{"#f":1}],"game_mechanics_info":["^I'm sure you've noticed the chest at the bottom left of your screen.","\n","^If you click that chest you will open up the player menu.","\n","^It consists of three columns:","\n","^The left column is the dungeon simulation's weapon upgrading system.","\n","^I'm guessing you know about the gold coins?","\n","^I'm not supposed to tell you this, but the gold coins are used to upgrade your weapon.","\n","^The number below the weapon represents the cost to upgrade the weapon.","\n","^Left-click the number with enough gold coins will upgrade your weapon.","\n","^You can upgrade your weapon a total of 9 times with each upgrade increasing its damage and push force.","\n","^Push force is basically how much knockback the enemy takes when you hit them.","\n","^Higher push force equals stronger knockback.","\n","^The right column is your \"dungeon stats\".","\n","^It's basically a way to show how many gold coins and health you have, as well as your level.","\n","^The middle column is just your avatar. You can change it to the dungeon's presets if you like.","\n","^Oh, I almost forgot.","\n","^The purple bar at the bottom is your \"dungeon experience\".","\n","^It's used to keep track of how close you are to \"levelling up\".","\n","^You gain 5 health each time you level up.","\n","^You also feel any injuries you have appear to be healed each time you level up.","\n","^The maximum level is 10, by the way.","\n","^There are a total of five levels to this dungeon.","\n","^The first level is a preliminary level to eliminate the unprepared applicants.","\n","^However, the other four levels get much harder as you progress.","\n","^Each boss at the end of each level becomes more difficult to defeat, especially the last one.","\n","^You should be fine anyways.","\n","^I should get going before I get caught by the staff.","\n","^Good luck on the exam!","\n","^Oh, and if you do pass the exam come by the <b><color=#c90076>training room.</color></b> I'll be waiting!","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}