{"inkVersion":20,"root":[[{"->":"main"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"main":[[{"#":"speaker:Intro NPC"},{"#":"portrait:intronpc_neutral"},{"#":"layout:right"},"^You're finally here!","\n","^You're finally here!","\n","^The other applicants have gone ahead of you.","\n","^This is the final exam: a combat-based exam.","\n","^You have to get through this simulated dungeon to pass the exam.","\n","^The <color=#6fa8dc>dungeon simulation</color> contains almost everything a regular dungeon would have, with a few rules and features to prevent severe injuries.","\n","^First, <b><color=#f44336>red</color></b> or <b><color=#8fce00>green</color></b> liquid that comes out of walls is what heals you.","\n","^If you're injured in any way you can rest at these walls for as long as you need.","\n","^Last, you cannot cast spells in any way.","\n","^The simulation is very sensitive to magic, so it is set up to suppress any spells that are about to be cast.","\n","^That's the gist of the exam.","\n","^You may either recall the information given to you from passing the previous exam, or you can proceed with the exam.","\n","ev","str","^Proceed","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Recall Info","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^Alright, good luck! The entrance to the simulated dungeon is up the stairs","\n","done",{"#f":5}],"c-1":["\n","^Alright, good luck! The entrance to the simulated dungeon is up the stairs","\n",{"->":"memoryrecall"},{"#f":5}]}],{"#f":1}],"memoryrecall":["^<i>(You begin to recall information from the previous exam) ",{"#":"speaker:Player"},{"#":"portrait:player_neutral"},{"#":"layout:left"},"\n","^<i>In the simulated dungeon, there are <color=#f1c232>chests</color> scattered in the dungeon that contains <color=#f1c232>gold coins.</color>","\n","^<i>The use of these <color=#f1c232>gold coins</color> are usually unknown to applicants until after they pass the exam.","\n","^<i>However, there are some who discover its use during their time in the dungeon.","\n","^<i>This is a rare case,","\n","^<i>but the staff who created this simulated dungeon collectively agree to allow the use of the gold coins during the exam.","\n","^<i>There are <color=#16537e>two</color> types of enemies in the dungeon:","\n","^<i><color=#c90076>Small enemies</color> which are not that tough and shouldn't deal serious damage to applicants,","\n","^<i>and <color=#6a329f>large enemies</color>, or in other words, <color=#6a329f>bosses.</color>","\n","^<i>Information of the bosses are unknown in order to eliminate applicants who are unable to quickly adapt to dire situations.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}